wty2019wty/esp32c3-ir-web-ESP32-C3/sdkconfig.defaults
# ESP32-C3 SuperMini: 4MB flash (ESP32C3FN4)
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# 1kHz tick for snappier timing
CONFIG_FREERTOS_HZ=1000

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
